manga/app/controllers/commentaries_controller.rb

SELECT  "ouvrages".* FROM "ouvrages" WHERE "ouvrages"."id" = $1 LIMIT 1  [["id", 6]]
INSERT INTO "commentaries" ("texte", "ouvrage_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["texte", "TROP BIEN !!!11!1"], ["ouvrage_id", 6], ["created_at", "2016-09-22 12:02:27.379633"], ["updated_at", "2016-09-22 12:02:27.379633"]]
UPDATE "commentaries" SET "user_id" = $1, "updated_at" = $2 WHERE "commentaries"."id" = $3  [["user_id", 1], ["updated_at", "2016-09-22 12:02:27.402744"], ["id", 1]]
---
	def create
		@ouvrage = Ouvrage.find(params[:ouvrage_id])
		@comment = @ouvrage.commentaries.create(comment_params)
		@comment.user_id = current_user.id
		if @comment.save