manga/app/controllers/ouvrages_controller.rb

SELECT  "ouvrages".* FROM "ouvrages" WHERE (title LIKE '%Bleach%' OR genre LIKE '%Bleach%' OR author LIKE '%Bleach%' OR editor LIKE '%Bleach%') LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "ouvrages"
---
  def index
    manga_per_page = 5

    sort = case params['sort']
           when "title"  then "title"
           when "author"   then "author"
           when "editor" then "editor"
           when "date" then "release_date"
           when "genre" then "genre"
           when "title_reverse"  then "title DESC"
           when "author_reverse"   then "author DESC"
           when "editor_reverse" then "editor DESC"
           when "date_reverse" then "release_date DESC"
           when "genre_reverse" then "genre DESC"
           end

    if params[:search]
      @ouvrages = Ouvrage.paginate(:page => params[:page], :per_page => manga_per_page).order(sort).search(params[:search])

SELECT  "ouvrages".* FROM "ouvrages" WHERE "ouvrages"."id" = $1 LIMIT 1  [["id", 22]]
SELECT  "commentaries".* FROM "commentaries" WHERE "commentaries"."ouvrage_id" = $1  ORDER BY created_at DESC LIMIT 5 OFFSET 0  [["ouvrage_id", 22]]
---
  def show
    @ouvrage = Ouvrage.find(params[:id])
    @comments = Commentary.where(:ouvrage_id => @ouvrage.id).paginate(:page => params[:page], :per_page => 5).order("created_at DESC")

SELECT  "ouvrages".* FROM "ouvrages" WHERE "ouvrages"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."borrow1" = $1  [["borrow1", "Evangelion tome 1"]]
SELECT "users".* FROM "users" WHERE "users"."borrow2" = $1  [["borrow2", "Evangelion tome 1"]]
SELECT "users".* FROM "users" WHERE "users"."borrow3" = $1  [["borrow3", "Evangelion tome 1"]]
UPDATE "users" SET "borrow1" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["borrow1", "Evangelion tome 1"], ["updated_at", "2016-09-22 12:03:29.125639"], ["id", 1]]
---
  def borrows
    @ouvrage = Ouvrage.find(params[:id])

    @user = current_user
    @emprunt = @ouvrage.title+" tome "+params[:tome].to_s
    @test1 = User.where(borrow1: @emprunt)
    @test2 = User.where(borrow2: @emprunt)
    @test3 = User.where(borrow3: @emprunt)

    if @test1 == [] && @test2 == [] && @test3 == [] && @user.current_borrows < 3
      @user.update_attribute(:current_borrows, @user.current_borrows + 1)