manga/app/controllers/pages_controller.rb

SELECT  "ouvrages".* FROM "ouvrages"  ORDER BY "ouvrages"."id" DESC LIMIT 1
---
  def home
  	@moment = rand(Ouvrage.last.id)