manga/app/controllers/users_controller.rb

UPDATE "users" SET "current_borrows" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["current_borrows", 0], ["updated_at", "2016-09-22 12:03:39.342210"], ["id", 1]]
---
	def del1
		@user = current_user
		@user.update_attribute(:borrow1, "")

UPDATE "users" SET "current_borrows" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["current_borrows", 1], ["updated_at", "2016-09-26 14:57:15.246854"], ["id", 2]]
---
	def del2
		@user = current_user
		@user.update_attribute(:borrow2, "")

UPDATE "users" SET "current_borrows" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["current_borrows", 0], ["updated_at", "2016-09-26 14:57:16.977035"], ["id", 2]]
---
	def del3
		@user = current_user
		@user.update_attribute(:borrow3, "")

SELECT  "users".* FROM "users" LIMIT 5 OFFSET 0
---
	def liste
		user_per_page = 5

		sort = case params['sort']
			when "email" then "email"
			when "pseudo" then "pseudo"
			when "name" then "name"
			when "surname" then "surname"
			when "course" then "course"
			when "year" then "year"
			when "current_borrows" then "current_borrows"
			when "last_sign_in_at" then "last_sign_in_at"
			when "admin" then "admin"
			when "email_reverse" then "email DESC"
			when "pseudo_reverse" then "pseudo DESC"
			when "name_reverse" then "name DESC"
			when "surname_reverse" then "surname DESC"
			when "course_reverse" then "course DESC"
			when "year_reverse" then "year DESC"
			when "current_borrows_reverse" then "current_borrows DESC"
			when "last_sign_in_at_reverse" then "last_sign_in_at DESC"
			when "admin_reverse" then "admin DESC"
			end

		@users = User.paginate(:page => params[:page], :per_page => user_per_page).order(sort)

UPDATE "users" SET "name" = $1, "surname" = $2, "pseudo" = $3, "course" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["name", ""], ["surname", ""], ["pseudo", "Upsylo"], ["course", ""], ["updated_at", "2016-09-26 14:54:24.961597"], ["id", 2]]
---
	def update
		@user = current_user
		if @user.update(user_params)