manga/app/views/pages/home.html.haml

SELECT  "ouvrages".* FROM "ouvrages" WHERE "ouvrages"."id" = $1 LIMIT 1  [["id", 35]]
---
                        %u Titre:
                        = Ouvrage.find(@moment).title
                    .li