manga/app/views/ouvrages/show.html.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
				%td
					- if User.find(comment.user_id).pseudo == nil